{"format": "layers-model", "generatedBy": "keras v2.2.0", "convertedBy": "TensorFlow.js Converter v1.2.3", "modelTopology": {"keras_version": "2.2.0", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"output_layers": [["dense_4", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"name": "input_3", "dtype": "float32", "batch_input_shape": [null, 224, 224, 3], "sparse": false}, "name": "input_3", "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": false, "name": "conv1_pad", "data_format": "channels_last"}, "name": "conv1_pad", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"padding": "valid", "name": "conv1", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [3, 3], "filters": 32, "trainable": false, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "strides": [2, 2]}, "name": "conv1", "inbound_nodes": [[["conv1_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "name": "conv1_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "trainable": false, "gamma_constraint": null, "axis": -1}, "name": "conv1_bn", "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "conv1_relu", "activation": "relu6"}, "name": "conv1_relu", "inbound_nodes": [[["conv1_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": false, "name": "conv_pad_1", "data_format": "channels_last"}, "name": "conv_pad_1", "inbound_nodes": [[["conv1_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"padding": "valid", "depthwise_constraint": null, "data_format": "channels_last", "depthwise_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "name": "conv_dw_1", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [3, 3], "depth_multiplier": 1, "activation": "linear", "dilation_rate": [1, 1], "trainable": false, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1]}, "name": "conv_dw_1", "inbound_nodes": [[["conv_pad_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "name": "conv_dw_1_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "trainable": false, "gamma_constraint": null, "axis": -1}, "name": "conv_dw_1_bn", "inbound_nodes": [[["conv_dw_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "conv_dw_1_relu", "activation": "relu6"}, "name": "conv_dw_1_relu", "inbound_nodes": [[["conv_dw_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"padding": "same", "name": "conv_pw_1", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [1, 1], "filters": 64, "trainable": false, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1]}, "name": "conv_pw_1", "inbound_nodes": [[["conv_dw_1_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "name": "conv_pw_1_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "trainable": false, "gamma_constraint": null, "axis": -1}, "name": "conv_pw_1_bn", "inbound_nodes": [[["conv_pw_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "conv_pw_1_relu", "activation": "relu6"}, "name": "conv_pw_1_relu", "inbound_nodes": [[["conv_pw_1_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": false, "name": "conv_pad_2", "data_format": "channels_last"}, "name": "conv_pad_2", "inbound_nodes": [[["conv_pw_1_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"padding": "valid", "depthwise_constraint": null, "data_format": "channels_last", "depthwise_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "name": "conv_dw_2", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [3, 3], "depth_multiplier": 1, "activation": "linear", "dilation_rate": [1, 1], "trainable": false, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [2, 2]}, "name": "conv_dw_2", "inbound_nodes": [[["conv_pad_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "name": "conv_dw_2_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "trainable": false, "gamma_constraint": null, "axis": -1}, "name": "conv_dw_2_bn", "inbound_nodes": [[["conv_dw_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "conv_dw_2_relu", "activation": "relu6"}, "name": "conv_dw_2_relu", "inbound_nodes": [[["conv_dw_2_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"padding": "same", "name": "conv_pw_2", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [1, 1], "filters": 128, "trainable": false, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1]}, "name": "conv_pw_2", "inbound_nodes": [[["conv_dw_2_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "name": "conv_pw_2_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "trainable": false, "gamma_constraint": null, "axis": -1}, "name": "conv_pw_2_bn", "inbound_nodes": [[["conv_pw_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "conv_pw_2_relu", "activation": "relu6"}, "name": "conv_pw_2_relu", "inbound_nodes": [[["conv_pw_2_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": false, "name": "conv_pad_3", "data_format": "channels_last"}, "name": "conv_pad_3", "inbound_nodes": [[["conv_pw_2_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"padding": "valid", "depthwise_constraint": null, "data_format": "channels_last", "depthwise_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "name": "conv_dw_3", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [3, 3], "depth_multiplier": 1, "activation": "linear", "dilation_rate": [1, 1], "trainable": false, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1]}, "name": "conv_dw_3", "inbound_nodes": [[["conv_pad_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "name": "conv_dw_3_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "trainable": false, "gamma_constraint": null, "axis": -1}, "name": "conv_dw_3_bn", "inbound_nodes": [[["conv_dw_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "conv_dw_3_relu", "activation": "relu6"}, "name": "conv_dw_3_relu", "inbound_nodes": [[["conv_dw_3_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"padding": "same", "name": "conv_pw_3", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [1, 1], "filters": 128, "trainable": false, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1]}, "name": "conv_pw_3", "inbound_nodes": [[["conv_dw_3_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "name": "conv_pw_3_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "trainable": false, "gamma_constraint": null, "axis": -1}, "name": "conv_pw_3_bn", "inbound_nodes": [[["conv_pw_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "conv_pw_3_relu", "activation": "relu6"}, "name": "conv_pw_3_relu", "inbound_nodes": [[["conv_pw_3_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": false, "name": "conv_pad_4", "data_format": "channels_last"}, "name": "conv_pad_4", "inbound_nodes": [[["conv_pw_3_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"padding": "valid", "depthwise_constraint": null, "data_format": "channels_last", "depthwise_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "name": "conv_dw_4", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [3, 3], "depth_multiplier": 1, "activation": "linear", "dilation_rate": [1, 1], "trainable": false, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [2, 2]}, "name": "conv_dw_4", "inbound_nodes": [[["conv_pad_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "name": "conv_dw_4_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "trainable": false, "gamma_constraint": null, "axis": -1}, "name": "conv_dw_4_bn", "inbound_nodes": [[["conv_dw_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "conv_dw_4_relu", "activation": "relu6"}, "name": "conv_dw_4_relu", "inbound_nodes": [[["conv_dw_4_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"padding": "same", "name": "conv_pw_4", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [1, 1], "filters": 256, "trainable": false, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1]}, "name": "conv_pw_4", "inbound_nodes": [[["conv_dw_4_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "name": "conv_pw_4_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "trainable": false, "gamma_constraint": null, "axis": -1}, "name": "conv_pw_4_bn", "inbound_nodes": [[["conv_pw_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "conv_pw_4_relu", "activation": "relu6"}, "name": "conv_pw_4_relu", "inbound_nodes": [[["conv_pw_4_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": false, "name": "conv_pad_5", "data_format": "channels_last"}, "name": "conv_pad_5", "inbound_nodes": [[["conv_pw_4_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"padding": "valid", "depthwise_constraint": null, "data_format": "channels_last", "depthwise_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "name": "conv_dw_5", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [3, 3], "depth_multiplier": 1, "activation": "linear", "dilation_rate": [1, 1], "trainable": false, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1]}, "name": "conv_dw_5", "inbound_nodes": [[["conv_pad_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "name": "conv_dw_5_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "trainable": false, "gamma_constraint": null, "axis": -1}, "name": "conv_dw_5_bn", "inbound_nodes": [[["conv_dw_5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "conv_dw_5_relu", "activation": "relu6"}, "name": "conv_dw_5_relu", "inbound_nodes": [[["conv_dw_5_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"padding": "same", "name": "conv_pw_5", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [1, 1], "filters": 256, "trainable": false, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1]}, "name": "conv_pw_5", "inbound_nodes": [[["conv_dw_5_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "name": "conv_pw_5_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "trainable": false, "gamma_constraint": null, "axis": -1}, "name": "conv_pw_5_bn", "inbound_nodes": [[["conv_pw_5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "conv_pw_5_relu", "activation": "relu6"}, "name": "conv_pw_5_relu", "inbound_nodes": [[["conv_pw_5_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": false, "name": "conv_pad_6", "data_format": "channels_last"}, "name": "conv_pad_6", "inbound_nodes": [[["conv_pw_5_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"padding": "valid", "depthwise_constraint": null, "data_format": "channels_last", "depthwise_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "name": "conv_dw_6", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [3, 3], "depth_multiplier": 1, "activation": "linear", "dilation_rate": [1, 1], "trainable": false, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [2, 2]}, "name": "conv_dw_6", "inbound_nodes": [[["conv_pad_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "name": "conv_dw_6_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "trainable": false, "gamma_constraint": null, "axis": -1}, "name": "conv_dw_6_bn", "inbound_nodes": [[["conv_dw_6", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "conv_dw_6_relu", "activation": "relu6"}, "name": "conv_dw_6_relu", "inbound_nodes": [[["conv_dw_6_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"padding": "same", "name": "conv_pw_6", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [1, 1], "filters": 512, "trainable": false, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1]}, "name": "conv_pw_6", "inbound_nodes": [[["conv_dw_6_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "name": "conv_pw_6_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "trainable": false, "gamma_constraint": null, "axis": -1}, "name": "conv_pw_6_bn", "inbound_nodes": [[["conv_pw_6", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "conv_pw_6_relu", "activation": "relu6"}, "name": "conv_pw_6_relu", "inbound_nodes": [[["conv_pw_6_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": false, "name": "conv_pad_7", "data_format": "channels_last"}, "name": "conv_pad_7", "inbound_nodes": [[["conv_pw_6_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"padding": "valid", "depthwise_constraint": null, "data_format": "channels_last", "depthwise_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "name": "conv_dw_7", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [3, 3], "depth_multiplier": 1, "activation": "linear", "dilation_rate": [1, 1], "trainable": false, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1]}, "name": "conv_dw_7", "inbound_nodes": [[["conv_pad_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "name": "conv_dw_7_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "trainable": false, "gamma_constraint": null, "axis": -1}, "name": "conv_dw_7_bn", "inbound_nodes": [[["conv_dw_7", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "conv_dw_7_relu", "activation": "relu6"}, "name": "conv_dw_7_relu", "inbound_nodes": [[["conv_dw_7_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"padding": "same", "name": "conv_pw_7", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [1, 1], "filters": 512, "trainable": false, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1]}, "name": "conv_pw_7", "inbound_nodes": [[["conv_dw_7_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "name": "conv_pw_7_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "trainable": false, "gamma_constraint": null, "axis": -1}, "name": "conv_pw_7_bn", "inbound_nodes": [[["conv_pw_7", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "conv_pw_7_relu", "activation": "relu6"}, "name": "conv_pw_7_relu", "inbound_nodes": [[["conv_pw_7_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": false, "name": "conv_pad_8", "data_format": "channels_last"}, "name": "conv_pad_8", "inbound_nodes": [[["conv_pw_7_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"padding": "valid", "depthwise_constraint": null, "data_format": "channels_last", "depthwise_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "name": "conv_dw_8", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [3, 3], "depth_multiplier": 1, "activation": "linear", "dilation_rate": [1, 1], "trainable": false, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1]}, "name": "conv_dw_8", "inbound_nodes": [[["conv_pad_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "name": "conv_dw_8_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "trainable": false, "gamma_constraint": null, "axis": -1}, "name": "conv_dw_8_bn", "inbound_nodes": [[["conv_dw_8", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "conv_dw_8_relu", "activation": "relu6"}, "name": "conv_dw_8_relu", "inbound_nodes": [[["conv_dw_8_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"padding": "same", "name": "conv_pw_8", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [1, 1], "filters": 512, "trainable": false, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1]}, "name": "conv_pw_8", "inbound_nodes": [[["conv_dw_8_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "name": "conv_pw_8_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "trainable": false, "gamma_constraint": null, "axis": -1}, "name": "conv_pw_8_bn", "inbound_nodes": [[["conv_pw_8", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "conv_pw_8_relu", "activation": "relu6"}, "name": "conv_pw_8_relu", "inbound_nodes": [[["conv_pw_8_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": false, "name": "conv_pad_9", "data_format": "channels_last"}, "name": "conv_pad_9", "inbound_nodes": [[["conv_pw_8_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"padding": "valid", "depthwise_constraint": null, "data_format": "channels_last", "depthwise_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "name": "conv_dw_9", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [3, 3], "depth_multiplier": 1, "activation": "linear", "dilation_rate": [1, 1], "trainable": false, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1]}, "name": "conv_dw_9", "inbound_nodes": [[["conv_pad_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "name": "conv_dw_9_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "trainable": false, "gamma_constraint": null, "axis": -1}, "name": "conv_dw_9_bn", "inbound_nodes": [[["conv_dw_9", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "conv_dw_9_relu", "activation": "relu6"}, "name": "conv_dw_9_relu", "inbound_nodes": [[["conv_dw_9_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"padding": "same", "name": "conv_pw_9", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [1, 1], "filters": 512, "trainable": false, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1]}, "name": "conv_pw_9", "inbound_nodes": [[["conv_dw_9_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "name": "conv_pw_9_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "trainable": false, "gamma_constraint": null, "axis": -1}, "name": "conv_pw_9_bn", "inbound_nodes": [[["conv_pw_9", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "conv_pw_9_relu", "activation": "relu6"}, "name": "conv_pw_9_relu", "inbound_nodes": [[["conv_pw_9_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": false, "name": "conv_pad_10", "data_format": "channels_last"}, "name": "conv_pad_10", "inbound_nodes": [[["conv_pw_9_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"padding": "valid", "depthwise_constraint": null, "data_format": "channels_last", "depthwise_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "name": "conv_dw_10", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [3, 3], "depth_multiplier": 1, "activation": "linear", "dilation_rate": [1, 1], "trainable": false, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1]}, "name": "conv_dw_10", "inbound_nodes": [[["conv_pad_10", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "name": "conv_dw_10_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "trainable": false, "gamma_constraint": null, "axis": -1}, "name": "conv_dw_10_bn", "inbound_nodes": [[["conv_dw_10", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "conv_dw_10_relu", "activation": "relu6"}, "name": "conv_dw_10_relu", "inbound_nodes": [[["conv_dw_10_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"padding": "same", "name": "conv_pw_10", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [1, 1], "filters": 512, "trainable": false, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1]}, "name": "conv_pw_10", "inbound_nodes": [[["conv_dw_10_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "name": "conv_pw_10_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "trainable": false, "gamma_constraint": null, "axis": -1}, "name": "conv_pw_10_bn", "inbound_nodes": [[["conv_pw_10", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "conv_pw_10_relu", "activation": "relu6"}, "name": "conv_pw_10_relu", "inbound_nodes": [[["conv_pw_10_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": false, "name": "conv_pad_11", "data_format": "channels_last"}, "name": "conv_pad_11", "inbound_nodes": [[["conv_pw_10_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"padding": "valid", "depthwise_constraint": null, "data_format": "channels_last", "depthwise_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "name": "conv_dw_11", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [3, 3], "depth_multiplier": 1, "activation": "linear", "dilation_rate": [1, 1], "trainable": false, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1]}, "name": "conv_dw_11", "inbound_nodes": [[["conv_pad_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "name": "conv_dw_11_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "trainable": false, "gamma_constraint": null, "axis": -1}, "name": "conv_dw_11_bn", "inbound_nodes": [[["conv_dw_11", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "conv_dw_11_relu", "activation": "relu6"}, "name": "conv_dw_11_relu", "inbound_nodes": [[["conv_dw_11_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"padding": "same", "name": "conv_pw_11", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [1, 1], "filters": 512, "trainable": false, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1]}, "name": "conv_pw_11", "inbound_nodes": [[["conv_dw_11_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "name": "conv_pw_11_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "trainable": false, "gamma_constraint": null, "axis": -1}, "name": "conv_pw_11_bn", "inbound_nodes": [[["conv_pw_11", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "conv_pw_11_relu", "activation": "relu6"}, "name": "conv_pw_11_relu", "inbound_nodes": [[["conv_pw_11_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": false, "name": "conv_pad_12", "data_format": "channels_last"}, "name": "conv_pad_12", "inbound_nodes": [[["conv_pw_11_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"padding": "valid", "depthwise_constraint": null, "data_format": "channels_last", "depthwise_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "name": "conv_dw_12", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [3, 3], "depth_multiplier": 1, "activation": "linear", "dilation_rate": [1, 1], "trainable": false, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [2, 2]}, "name": "conv_dw_12", "inbound_nodes": [[["conv_pad_12", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "name": "conv_dw_12_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "trainable": false, "gamma_constraint": null, "axis": -1}, "name": "conv_dw_12_bn", "inbound_nodes": [[["conv_dw_12", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "conv_dw_12_relu", "activation": "relu6"}, "name": "conv_dw_12_relu", "inbound_nodes": [[["conv_dw_12_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"padding": "same", "name": "conv_pw_12", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [1, 1], "filters": 1024, "trainable": false, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1]}, "name": "conv_pw_12", "inbound_nodes": [[["conv_dw_12_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "name": "conv_pw_12_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "trainable": false, "gamma_constraint": null, "axis": -1}, "name": "conv_pw_12_bn", "inbound_nodes": [[["conv_pw_12", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "conv_pw_12_relu", "activation": "relu6"}, "name": "conv_pw_12_relu", "inbound_nodes": [[["conv_pw_12_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": false, "name": "conv_pad_13", "data_format": "channels_last"}, "name": "conv_pad_13", "inbound_nodes": [[["conv_pw_12_relu", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"padding": "valid", "depthwise_constraint": null, "data_format": "channels_last", "depthwise_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "name": "conv_dw_13", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [3, 3], "depth_multiplier": 1, "activation": "linear", "dilation_rate": [1, 1], "trainable": false, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1]}, "name": "conv_dw_13", "inbound_nodes": [[["conv_pad_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "name": "conv_dw_13_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "trainable": false, "gamma_constraint": null, "axis": -1}, "name": "conv_dw_13_bn", "inbound_nodes": [[["conv_dw_13", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "conv_dw_13_relu", "activation": "relu6"}, "name": "conv_dw_13_relu", "inbound_nodes": [[["conv_dw_13_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"padding": "same", "name": "conv_pw_13", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [1, 1], "filters": 1024, "trainable": true, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1]}, "name": "conv_pw_13", "inbound_nodes": [[["conv_dw_13_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true, "name": "conv_pw_13_bn", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "axis": -1}, "name": "conv_pw_13_bn", "inbound_nodes": [[["conv_pw_13", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "conv_pw_13_relu", "activation": "relu6"}, "name": "conv_pw_13_relu", "inbound_nodes": [[["conv_pw_13_bn", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"trainable": true, "name": "global_average_pooling2d_3", "data_format": "channels_last"}, "name": "global_average_pooling2d_3", "inbound_nodes": [[["conv_pw_13_relu", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_4", "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "units": 2, "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true}, "name": "dense_4", "inbound_nodes": [[["global_average_pooling2d_3", 0, 0, {}]]]}], "input_layers": [["input_3", 0, 0]], "name": "model_2"}}, "training_config": {"sample_weight_mode": null, "loss_weights": null, "loss": "categorical_crossentropy", "optimizer_config": {"class_name": "Adam", "config": {"epsilon": 1e-07, "beta_2": 0.9990000128746033, "lr": 9.999999747378752e-05, "decay": 0.0, "beta_1": 0.8999999761581421, "amsgrad": false}}, "metrics": ["accuracy"]}}, "weightsManifest": [{"paths": ["group1-shard1of4.bin", "group1-shard2of4.bin", "group1-shard3of4.bin", "group1-shard4of4.bin"], "weights": [{"name": "conv1_2/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv1_bn_2/gamma", "shape": [32], "dtype": "float32"}, {"name": "conv1_bn_2/beta", "shape": [32], "dtype": "float32"}, {"name": "conv1_bn_2/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "conv1_bn_2/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_1_2/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "conv_dw_10_2/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_10_bn_2/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_10_bn_2/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_10_bn_2/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_10_bn_2/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_11_2/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_11_bn_2/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_11_bn_2/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_11_bn_2/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_11_bn_2/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_12_2/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_12_bn_2/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_12_bn_2/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_12_bn_2/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_12_bn_2/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_13_2/depthwise_kernel", "shape": [3, 3, 1024, 1], "dtype": "float32"}, {"name": "conv_dw_13_bn_2/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv_dw_13_bn_2/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv_dw_13_bn_2/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv_dw_13_bn_2/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv_dw_1_bn_2/gamma", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_1_bn_2/beta", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_1_bn_2/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_1_bn_2/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_2_2/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "conv_dw_2_bn_2/gamma", "shape": [64], "dtype": "float32"}, {"name": "conv_dw_2_bn_2/beta", "shape": [64], "dtype": "float32"}, {"name": "conv_dw_2_bn_2/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "conv_dw_2_bn_2/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv_dw_3_2/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "conv_dw_3_bn_2/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_3_bn_2/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_3_bn_2/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_3_bn_2/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_4_2/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "conv_dw_4_bn_2/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_4_bn_2/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_4_bn_2/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_4_bn_2/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_5_2/depthwise_kernel", "shape": [3, 3, 256, 1], "dtype": "float32"}, {"name": "conv_dw_5_bn_2/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_5_bn_2/beta", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_5_bn_2/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_5_bn_2/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_6_2/depthwise_kernel", "shape": [3, 3, 256, 1], "dtype": "float32"}, {"name": "conv_dw_6_bn_2/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_6_bn_2/beta", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_6_bn_2/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_6_bn_2/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_7_2/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_7_bn_2/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_7_bn_2/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_7_bn_2/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_7_bn_2/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_8_2/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_8_bn_2/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_8_bn_2/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_8_bn_2/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_8_bn_2/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_9_2/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_9_bn_2/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_9_bn_2/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_9_bn_2/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_9_bn_2/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_1_2/kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "conv_pw_10_2/kernel", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "conv_pw_10_bn_2/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_10_bn_2/beta", "shape": [512], "dtype": 